# Задание 1 Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

n = str(input('Введите вещественное число: '))
sum = 0
for i in n:
    if i.isdigit():
        sum = sum + int(i)
print(sum)

#///////////////////////////////////////////////////////////////////////////////////////
#Задание 2 Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

N = int(input('Введите число: '))
a = []
res = 1
for i in range(1, N+1):
    res *= i
    a.append(res)
print(a)


#//////////////////////////////////////////////////////////////////////////////////////////
# Задание 3 Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму,
# округлённую до трёх знаков после точки.

n = int(input('Введите число: '))
a = []
summa = 0
for i in range(1, n+1):
    a.append((1+1/i)**i)
print(a)
summa = sum(a)
print(round(summa, 3))


#///////////////////////////////////////////////////////////////////////////////////////////
# Задание 4 Задайте список из N элементов, заполненных числами из промежутка [-N, N].
# Найдите произведение элементов на позициях a и b.
# Значения N, a и b вводит пользователь с клавиатуры.

N = int(input('Введите число: '))
a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))

n = list(range(-N, N+1))
print(n)
res = n[a-1] * n[b-1]
print(res)

#////////////////////////////////////////////////////////////////////////
# Задание 6 Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.

a = str(input('Введите первую строку: '))
b = str(input('Введите вторую строку: '))
index=0
count=0
x=0
while x != -1:
    x = a.find(b, index)
    index=x+1
    if x!=-1:
        count=count+1
print(count)